#include <stdio.h>


// О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
// 1. О©╫О©╫О©╫О©╫О©╫О©╫О©╫О©╫
// 2. О©╫О©╫О©╫О©╫О©╫О©╫О©╫О©╫ 
// 3. О©╫О©╫О©╫О©╫О©╫О©╫О©╫О©╫(static)
// 4. О©╫э╨н╨О©╫О©╫О©╫(extern)



// О©╫ч╦О©╫ О©╫О©╫О©╫О©╫
// 1. О©╫О©╫О©╫ц©О©╫О©╫О©╫
// 2. О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫(О©╫О©╫О©╫О©╫ 2, 3, 4)
// 3. О©╫п╠О©╫ О©╫О©╫О©╫О©╫(О©╫з╣О©╫, ROM)
// 4. О©╫О©╫ О©╫О©╫О©╫О©╫



// О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
int g_i = 0;  // Data О©╫О©╫О©╫О©╫

// Data О©╫О©╫О©╫О©╫ ф╞б║
// О©╫О©╫О©╫н╠в╥О©╫ О©╫О©╫О©╫О©╫ О©╫О©╫ О©╫О©╫О©╫О©╫
// О©╫О©╫О©╫н╠в╥О©╫ О©╫О©╫О©╫О©╫ О©╫О©╫ О©╫О©╫О©╫О©╫

#include "fun.h"
// О©╫О©╫О©╫О©╫О©╫О©╫о©О©╫О©╫О©?О©╫О©╫О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫о╢б╟О©╫ О©╫О©╫О©╫О©╫.

// а╓юШ╨╞╪Ж

static int g_istatic = 0;

// а╓юШ╨╞╪Ж╢б ╪╠╬П╣г╢б ю╖д║©║ ╣Ш╤С╪╜ ╣©юшюл бВюл╟║ юж╢ы.
// а╓юШ╨╞╪Ж╢б ╣╔юлем ©╣©╙©║ ╪╠╬П╣г╬Н ╟Х╪с а╦юГгоаЖ╦╦ ╪╠╬Пгя аЖ©╙ Ё╩©║╪╜╦╦ ╩Г©К╟║╢и
// ╢ы╦╔╟В©║╪╜ а╒╠ыгоаЖ ╦Ьго╟т го╠Б ю╖гь ╬╡╢б юлю╞╣╣ южю╫







int main()
{

	g_istatic;
	Add(5, 4);


	g_i = 0;
	printf("Test гт╪Ж хёцБ х╫╪Ж : %d\n", g_i);

	return 0;

	// фВюнем ╨╞╪Ж
	// аж╪р╦╕ ╟║╦╝е╟╢б ╨╞╪Ж
	int i = 100;
	float f = 3.f;

	//int *pInt = &i;
	int* pInt = (int*)&f;

	// int гЭ фВюнем╢б юз╠Б╟║ ╟║╦╝еЁ ╣╔юлем е╦ютю╩ а╓гьЁУ╢б╟м
	// ex: (int фВюнем) 4╧ыюлф╝, ╣╔юлем е╦ютюл ╬Н╤╡ аЖ╢б аъ©ДгоаЖ ╬йю╫
	// ╧╚а╤╟г 4╧ыюлф╝╥н юз╦╖
	// аж╪р╥н а╒╠ы

	i = *pInt;
	return 0;
}

